iDynamicsPackagesModules/Evaluations/legacyFiles/Cluster_10_Nodes/Policy1_eval_Graph_dynamics/Policy1_evaluated_data/wrk2_response_data/output_result_2025_03_18_07_09.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 50.174ms, rate sampling interval: 206ms
  Thread calibration: mean lat.: 63.334ms, rate sampling interval: 355ms
  Thread calibration: mean lat.: 60.324ms, rate sampling interval: 313ms
  Thread calibration: mean lat.: 67.243ms, rate sampling interval: 352ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    57.33ms   48.30ms 197.76ms   84.13%
    Req/Sec     6.41      4.84    19.00     73.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.62ms
 75.000%   36.13ms
 90.000%  156.16ms
 99.000%  197.76ms
 99.900%  212.61ms
 99.990%  343.81ms
 99.999%  343.81ms
100.000%  343.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.431     0.000000            1         1.00
      33.471     0.100000          314         1.11
      33.759     0.200000          615         1.25
      34.015     0.300000          916         1.43
      34.303     0.400000         1237         1.67
      34.623     0.500000         1531         2.00
      34.783     0.550000         1677         2.22
      34.975     0.600000         1837         2.50
      35.199     0.650000         1988         2.86
      35.519     0.700000         2131         3.33
      36.127     0.750000         2285         4.00
      37.631     0.775000         2359         4.44
      65.023     0.800000         2435         5.00
      90.879     0.825000         2511         5.71
     113.023     0.850000         2587         6.67
     137.087     0.875000         2663         8.00
     146.559     0.887500         2701         8.89
     156.159     0.900000         2741        10.00
     168.703     0.912500         2777        11.43
     176.511     0.925000         2818        13.33
     177.279     0.937500         2853        16.00
     177.663     0.943750         2879        17.78
     177.919     0.950000         2891        20.00
     178.303     0.956250         2911        22.86
     178.815     0.962500         2931        26.67
     179.583     0.968750         2952        32.00
     179.839     0.971875         2959        35.56
     180.223     0.975000         2969        40.00
     180.607     0.978125         2977        45.71
     180.991     0.981250         2987        53.33
     181.887     0.984375         2996        64.00
     185.471     0.985938         3001        71.11
     188.671     0.987500         3005        80.00
     196.991     0.989062         3010        91.43
     198.015     0.990625         3015       106.67
     199.551     0.992188         3021       128.00
     199.807     0.992969         3022       142.22
     200.191     0.993750         3024       160.00
     200.447     0.994531         3027       182.86
     200.959     0.995313         3029       213.33
     201.727     0.996094         3032       256.00
     201.855     0.996484         3033       284.44
     202.495     0.996875         3034       320.00
     202.751     0.997266         3035       365.71
     203.391     0.997656         3036       426.67
     205.055     0.998047         3038       512.00
     205.055     0.998242         3038       568.89
     211.967     0.998437         3039       640.00
     211.967     0.998633         3039       731.43
     212.607     0.998828         3040       853.33
     220.287     0.999023         3041      1024.00
     220.287     0.999121         3041      1137.78
     220.287     0.999219         3041      1280.00
     220.287     0.999316         3041      1462.86
     224.895     0.999414         3042      1706.67
     224.895     0.999512         3042      2048.00
     224.895     0.999561         3042      2275.56
     224.895     0.999609         3042      2560.00
     224.895     0.999658         3042      2925.71
     343.807     0.999707         3043      3413.33
     343.807     1.000000         3043          inf
#[Mean    =       57.328, StdDeviation   =       48.295]
#[Max     =      343.552, Total count    =         3043]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  3334 requests in 2.00m, 6.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 3419
Requests/sec:     27.77  
Transfer/sec:     59.31KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 57.474ms, rate sampling interval: 312ms
  Thread calibration: mean lat.: 56.940ms, rate sampling interval: 251ms
  Thread calibration: mean lat.: 58.584ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 53.420ms, rate sampling interval: 230ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    56.06ms   45.73ms 203.13ms   85.78%
    Req/Sec     1.85      2.45     9.00     90.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.90ms
 75.000%   36.99ms
 90.000%  136.19ms
 99.000%  203.13ms
 99.900%  238.21ms
 99.990%  260.61ms
 99.999%  260.61ms
100.000%  260.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.991     0.000000            1         1.00
      34.495     0.100000           93         1.11
      34.975     0.200000          180         1.25
      35.359     0.300000          276         1.43
      35.615     0.400000          363         1.67
      35.903     0.500000          456         2.00
      36.031     0.550000          495         2.22
      36.191     0.600000          543         2.50
      36.415     0.650000          591         2.86
      36.607     0.700000          633         3.33
      36.991     0.750000          676         4.00
      39.295     0.775000          698         4.44
      48.383     0.800000          720         5.00
      71.999     0.825000          743         5.71
      93.183     0.850000          765         6.67
     114.495     0.875000          788         8.00
     125.695     0.887500          799         8.89
     136.191     0.900000          810        10.00
     148.863     0.912500          822        11.43
     170.495     0.925000          833        13.33
     179.327     0.937500          845        16.00
     179.967     0.943750          850        17.78
     180.351     0.950000          855        20.00
     181.247     0.956250          863        22.86
     181.887     0.962500          867        26.67
     182.527     0.968750          872        32.00
     183.295     0.971875          875        35.56
     183.935     0.975000          878        40.00
     185.471     0.978125          882        45.71
     191.871     0.981250          884        53.33
     199.551     0.984375          886        64.00
     201.983     0.985938          888        71.11
     202.751     0.987500          889        80.00
     203.135     0.989062          891        91.43
     203.263     0.990625          892       106.67
     203.519     0.992188          893       128.00
     204.287     0.992969          895       142.22
     204.287     0.993750          895       160.00
     206.335     0.994531          896       182.86
     206.335     0.995313          896       213.33
     206.847     0.996094          897       256.00
     206.847     0.996484          897       284.44
     209.791     0.996875          898       320.00
     209.791     0.997266          898       365.71
     209.791     0.997656          898       426.67
     238.207     0.998047          899       512.00
     238.207     0.998242          899       568.89
     238.207     0.998437          899       640.00
     238.207     0.998633          899       731.43
     238.207     0.998828          899       853.33
     260.607     0.999023          900      1024.00
     260.607     1.000000          900          inf
#[Mean    =       56.057, StdDeviation   =       45.735]
#[Max     =      260.480, Total count    =          900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  990 requests in 2.00m, 2.09MB read
  Socket errors: connect 0, read 0, write 0, timeout 5076
Requests/sec:      8.25  
Transfer/sec:     17.80KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 52.531ms, rate sampling interval: 269ms
  Thread calibration: mean lat.: 52.610ms, rate sampling interval: 231ms
  Thread calibration: mean lat.: 57.197ms, rate sampling interval: 270ms
  Thread calibration: mean lat.: 58.025ms, rate sampling interval: 262ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    49.92ms   38.64ms 197.25ms   87.03%
    Req/Sec    11.41      6.80    30.00     74.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.17ms
 75.000%   35.42ms
 90.000%  111.61ms
 99.000%  197.25ms
 99.900%  220.54ms
 99.990%  276.73ms
 99.999%  279.55ms
100.000%  279.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.143     0.000000            1         1.00
      33.119     0.100000          538         1.11
      33.407     0.200000         1076         1.25
      33.663     0.300000         1604         1.43
      33.919     0.400000         2140         1.67
      34.175     0.500000         2641         2.00
      34.335     0.550000         2920         2.22
      34.495     0.600000         3160         2.50
      34.687     0.650000         3404         2.86
      34.975     0.700000         3685         3.33
      35.423     0.750000         3922         4.00
      36.127     0.775000         4052         4.44
      44.415     0.800000         4181         5.00
      48.767     0.825000         4312         5.71
      67.839     0.850000         4444         6.67
      90.175     0.875000         4573         8.00
     101.631     0.887500         4642         8.89
     111.743     0.900000         4704        10.00
     121.407     0.912500         4769        11.43
     131.455     0.925000         4835        13.33
     144.511     0.937500         4901        16.00
     151.167     0.943750         4933        17.78
     155.647     0.950000         4965        20.00
     163.711     0.956250         4998        22.86
     169.471     0.962500         5031        26.67
     176.639     0.968750         5065        32.00
     177.023     0.971875         5082        35.56
     177.407     0.975000         5097        40.00
     178.175     0.978125         5114        45.71
     178.943     0.981250         5132        53.33
     180.479     0.984375         5145        64.00
     185.471     0.985938         5153        71.11
     188.671     0.987500         5162        80.00
     191.999     0.989062         5170        91.43
     197.631     0.990625         5178       106.67
     198.271     0.992188         5187       128.00
     198.527     0.992969         5190       142.22
     199.039     0.993750         5194       160.00
     199.295     0.994531         5198       182.86
     199.679     0.995313         5202       213.33
     200.191     0.996094         5207       256.00
     200.319     0.996484         5208       284.44
     200.447     0.996875         5210       320.00
     200.959     0.997266         5212       365.71
     201.215     0.997656         5214       426.67
     201.599     0.998047         5216       512.00
     201.855     0.998242         5217       568.89
     203.391     0.998437         5218       640.00
     204.415     0.998633         5219       731.43
     216.319     0.998828         5220       853.33
     220.543     0.999023         5221      1024.00
     232.191     0.999121         5222      1137.78
     232.191     0.999219         5222      1280.00
     235.391     0.999316         5223      1462.86
     235.391     0.999414         5223      1706.67
     254.463     0.999512         5224      2048.00
     254.463     0.999561         5224      2275.56
     254.463     0.999609         5224      2560.00
     276.735     0.999658         5225      2925.71
     276.735     0.999707         5225      3413.33
     276.735     0.999756         5225      4096.00
     276.735     0.999780         5225      4551.11
     276.735     0.999805         5225      5120.00
     279.551     0.999829         5226      5851.43
     279.551     1.000000         5226          inf
#[Mean    =       49.918, StdDeviation   =       38.644]
#[Max     =      279.296, Total count    =         5226]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5746 requests in 2.00m, 11.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 2306
Requests/sec:     47.87  
Transfer/sec:     97.61KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 50.947ms, rate sampling interval: 224ms
  Thread calibration: mean lat.: 54.645ms, rate sampling interval: 248ms
  Thread calibration: mean lat.: 44.855ms, rate sampling interval: 138ms
  Thread calibration: mean lat.: 46.544ms, rate sampling interval: 178ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    46.11ms   31.42ms 187.52ms   89.75%
    Req/Sec    16.47      9.72    43.00     72.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.85ms
 75.000%   35.20ms
 90.000%   79.61ms
 99.000%  187.52ms
 99.900%  203.65ms
 99.990%  231.29ms
 99.999%  240.77ms
100.000%  240.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.015     0.000000            2         1.00
      32.895     0.100000          775         1.11
      33.183     0.200000         1572         1.25
      33.407     0.300000         2292         1.43
      33.631     0.400000         3054         1.67
      33.855     0.500000         3770         2.00
      33.983     0.550000         4095         2.22
      34.143     0.600000         4471         2.50
      34.335     0.650000         4849         2.86
      34.623     0.700000         5213         3.33
      35.231     0.750000         5567         4.00
      36.095     0.775000         5750         4.44
      44.735     0.800000         5935         5.00
      50.719     0.825000         6118         5.71
      59.615     0.850000         6303         6.67
      67.647     0.875000         6489         8.00
      68.863     0.887500         6581         8.89
      79.615     0.900000         6675        10.00
      91.327     0.912500         6767        11.43
     101.823     0.925000         6859        13.33
     112.575     0.937500         6952        16.00
     120.703     0.943750         6998        17.78
     123.455     0.950000         7045        20.00
     131.583     0.956250         7091        22.86
     134.527     0.962500         7137        26.67
     144.767     0.968750         7188        32.00
     146.303     0.971875         7208        35.56
     154.879     0.975000         7230        40.00
     156.927     0.978125         7254        45.71
     165.759     0.981250         7276        53.33
     175.487     0.984375         7300        64.00
     176.767     0.985938         7312        71.11
     177.535     0.987500         7323        80.00
     179.327     0.989062         7335        91.43
     189.823     0.990625         7346       106.67
     197.759     0.992188         7358       128.00
     198.271     0.992969         7363       142.22
     198.783     0.993750         7369       160.00
     199.167     0.994531         7375       182.86
     199.551     0.995313         7382       213.33
     199.807     0.996094         7387       256.00
     199.935     0.996484         7391       284.44
     200.063     0.996875         7395       320.00
     200.063     0.997266         7395       365.71
     200.319     0.997656         7398       426.67
     200.575     0.998047         7401       512.00
     200.831     0.998242         7402       568.89
     201.343     0.998437         7404       640.00
     201.599     0.998633         7405       731.43
     202.239     0.998828         7407       853.33
     203.647     0.999023         7408      1024.00
     211.839     0.999121         7409      1137.78
     215.167     0.999219         7410      1280.00
     215.167     0.999316         7410      1462.86
     215.551     0.999414         7411      1706.67
     221.695     0.999512         7412      2048.00
     221.695     0.999561         7412      2275.56
     222.591     0.999609         7413      2560.00
     222.591     0.999658         7413      2925.71
     222.591     0.999707         7413      3413.33
     231.295     0.999756         7414      4096.00
     231.295     0.999780         7414      4551.11
     231.295     0.999805         7414      5120.00
     231.295     0.999829         7414      5851.43
     231.295     0.999854         7414      6826.67
     240.767     0.999878         7415      8192.00
     240.767     1.000000         7415          inf
#[Mean    =       46.109, StdDeviation   =       31.420]
#[Max     =      240.640, Total count    =         7415]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8119 requests in 2.00m, 16.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 1535
Requests/sec:     67.64  
Transfer/sec:    140.47KB